---
kind: type
id: T:Autodesk.Revit.DB.CurveLoopIterator
source: html/27c948e0-c433-9ee9-04a5-4bbeed79062f.htm
---
# Autodesk.Revit.DB.CurveLoopIterator

An iterator to a curve loop.

## Syntax (C#)
```csharp
public class CurveLoopIterator : IEnumerator<Curve>
```